#Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
#Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

from random import randint
set_n = set(randint(1, 20) for i in range(int(input('Введите кол-во элементов множества 1: '))))
print(set_n)
set_m = set(randint(1, 20) for i in range(int(input('Введите кол-во элементов множества 2: '))))
print(set_m)
set_s = sorted(set_n.intersection(set_m))
print(*set_s)

