#Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
#Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
#В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

#*Пример:*

#5
#    1 2 3 4 5
#    3
#    -> 1

N = abs(int(input('Введите количество элементов списка А: ')))
A_enter = input("Введите через пробел элементы списка А: ").split()
A_num = list(map(int, A_enter))
if len(A_num) != N:
    print('Количество элементов не соответствуют написанному количеству списка А!')
else:
    X = int(input('Введите число X, которое нужно найти в списке А: '))
    count = 0
    for i in range(N):
        if A_num[i] == X:
            count += 1
    print(f'Число {X} встречается в списке A {count} раз') 